from tkinter import *

QuestionsAboutAnimals = {
    'Выберите Ваше любимое время суток:' : ["Утро", "День", "Вечер", "Ночь"],
    'Какое время года Вы предпочитаете?' : ["Зима", "Весна", "Лето", "Осень"],
    'Какой ландшафт Вам по душе?' : ["Горы", "Лес", "Пустыня", "Вода"],
    'Выберите качество, которое лучше всего Вас описывает:' : ["Дружелюбый(ая)", "Агрессивный(ая)", "Гордый(ая)", "Отважный(ая)"],
    'Что для Вас важное в жизни?' : ["Семья и дети", "Карьера", "Здоровье", "Творчество"],
    'Что Вы не можете терпеть?' : ["Предательство", "Ложь", "Одиночество", "Зависть"],
    'Какое, по вашему мнению, Ваше отрицательное качество?' : ["Медлительность", "Зависть", "Придирчивость", "Неумение говорить 'НЕТ'"],
    'Чем Вы больше всего любите заниматься?' : ["Слушать музыку", "Заниматься спортом", "Рукодельничать", "Читать книги"],
    'Куда Вы любите путешествовать?' : ["Ближе к дому", "Куда-то в горы", "В теплые края, на море и пляжи", "Не люблю путешествовать"],
    'Выберите свое любимое блюдо:' : ["Мясные изделия", "Различные салаты", "Рыбные изделия", "Фастфуд"],
    'Где Вас, вероятнее всего, можно будет найти вечером в пятницу?' : ["Дома в одиночестве", "В каком-нибудь заведении с друзьями", "В кругу семьи", "Как карта ляжет"],
    'Выберите спорт, которым Вам бы хотелось заняться?' : ["Хоккей", "Водное поло", "Бег с препятствиями", "Гольф"],
    'Какой из этих работ Вы бы скорее занялись?' : ["Пожарный", "Космонавт", "Учитель", "Художник"],
    'Как вы предпочитаете путешествовать?' : ["На лодке", "На поезде", "На самолёте", "На автомобиле"],
    'Какой жанр книг Вам ближе?' : ["Роман", "Комедия", "Ужасы", "Мистика"]}
